RT-Thread/rt-thread/bsp/Infineon/psoc6-rtt-062S2/libs/TARGET_RTT-062S2/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_BUTTON0_NUM_CONV_VALUE                                       (cy_capsense_tuner.widgetContext[0].resolution)
#define CY_CAPSENSE_BUTTON0_NUM_CONV_OFFSET                                      (44u)
#define CY_CAPSENSE_BUTTON0_NUM_CONV_SIZE                                        (2u)
#define CY_CAPSENSE_BUTTON0_NUM_CONV_PARAM_ID                                    (0x0600002cu)

#define CY_CAPSENSE_BUTTON0_MAXRAWCOUNT_VALUE                                    (cy_capsense_tuner.widgetContext[0].maxRawCount)
#define CY_CAPSENSE_BUTTON0_MAXRAWCOUNT_OFFSET                                   (46u)
#define CY_CAPSENSE_BUTTON0_MAXRAWCOUNT_SIZE                                     (2u)
#define CY_CAPSENSE_BUTTON0_MAXRAWCOUNT_PARAM_ID                                 (0x0200002eu)

#define CY_CAPSENSE_BUTTON0_FINGER_TH_VALUE                                      (cy_capsense_tuner.widgetContext[0].fingerTh)
#define CY_CAPSENSE_BUTTON0_FINGER_TH_OFFSET                                     (48u)
#define CY_CAPSENSE_BUTTON0_FINGER_TH_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON0_FINGER_TH_PARAM_ID                                   (0x06000030u)

#define CY_CAPSENSE_BUTTON0_PROX_TOUCH_TH_VALUE                                  (cy_capsense_tuner.widgetContext[0].proxTh)
#define CY_CAPSENSE_BUTTON0_PROX_TOUCH_TH_OFFSET                                 (50u)
#define CY_CAPSENSE_BUTTON0_PROX_TOUCH_TH_SIZE                                   (2u)
#define CY_CAPSENSE_BUTTON0_PROX_TOUCH_TH_PARAM_ID                               (0x06000032u)

#define CY_CAPSENSE_BUTTON0_LOW_BSLN_RST_VALUE                                   (cy_capsense_tuner.widgetContext[0].lowBslnRst)
#define CY_CAPSENSE_BUTTON0_LOW_BSLN_RST_OFFSET                                  (52u)
#define CY_CAPSENSE_BUTTON0_LOW_BSLN_RST_SIZE                                    (2u)
#define CY_CAPSENSE_BUTTON0_LOW_BSLN_RST_PARAM_ID                                (0x06000034u)

#define CY_CAPSENSE_BUTTON0_TX_CLK_VALUE                                         (cy_capsense_tuner.widgetContext[0].snsClk)
#define CY_CAPSENSE_BUTTON0_TX_CLK_OFFSET                                        (54u)
#define CY_CAPSENSE_BUTTON0_TX_CLK_SIZE                                          (2u)
#define CY_CAPSENSE_BUTTON0_TX_CLK_PARAM_ID                                      (0x06000036u)

#define CY_CAPSENSE_BUTTON0_ROW_SNS_CLK_VALUE                                    (cy_capsense_tuner.widgetContext[0].rowSnsClk)
#define CY_CAPSENSE_BUTTON0_ROW_SNS_CLK_OFFSET                                   (56u)
#define CY_CAPSENSE_BUTTON0_ROW_SNS_CLK_SIZE                                     (2u)
#define CY_CAPSENSE_BUTTON0_ROW_SNS_CLK_PARAM_ID                                 (0x06000038u)

#define CY_CAPSENSE_BUTTON0_GESTURE_DETECTED_VALUE                               (cy_capsense_tuner.widgetContext[0].gestureDetected)
#define CY_CAPSENSE_BUTTON0_GESTURE_DETECTED_OFFSET                              (58u)
#define CY_CAPSENSE_BUTTON0_GESTURE_DETECTED_SIZE                                (2u)
#define CY_CAPSENSE_BUTTON0_GESTURE_DETECTED_PARAM_ID                            (0x0200003au)

#define CY_CAPSENSE_BUTTON0_GESTURE_DIRECTION_VALUE                              (cy_capsense_tuner.widgetContext[0].gestureDirection)
#define CY_CAPSENSE_BUTTON0_GESTURE_DIRECTION_OFFSET                             (60u)
#define CY_CAPSENSE_BUTTON0_GESTURE_DIRECTION_SIZE                               (2u)
#define CY_CAPSENSE_BUTTON0_GESTURE_DIRECTION_PARAM_ID                           (0x0200003cu)

#define CY_CAPSENSE_BUTTON0_XDELTA_VALUE                                         (cy_capsense_tuner.widgetContext[0].xDelta)
#define CY_CAPSENSE_BUTTON0_XDELTA_OFFSET                                        (62u)
#define CY_CAPSENSE_BUTTON0_XDELTA_SIZE                                          (2u)
#define CY_CAPSENSE_BUTTON0_XDELTA_PARAM_ID                                      (0x0200003eu)

#define CY_CAPSENSE_BUTTON0_YDELTA_VALUE                                         (cy_capsense_tuner.widgetContext[0].yDelta)
#define CY_CAPSENSE_BUTTON0_YDELTA_OFFSET                                        (64u)
#define CY_CAPSENSE_BUTTON0_YDELTA_SIZE                                          (2u)
#define CY_CAPSENSE_BUTTON0_YDELTA_PARAM_ID                                      (0x02000040u)

#define CY_CAPSENSE_BUTTON0_NOISE_TH_VALUE                                       (cy_capsense_tuner.widgetContext[0].noiseTh)
#define CY_CAPSENSE_BUTTON0_NOISE_TH_OFFSET                                      (66u)
#define CY_CAPSENSE_BUTTON0_NOISE_TH_SIZE                                        (1u)
#define CY_CAPSENSE_BUTTON0_NOISE_TH_PARAM_ID                                    (0x05000042u)

#define CY_CAPSENSE_BUTTON0_NNOISE_TH_VALUE                                      (cy_capsense_tuner.widgetContext[0].nNoiseTh)
#define CY_CAPSENSE_BUTTON0_NNOISE_TH_OFFSET                                     (67u)
#define CY_CAPSENSE_BUTTON0_NNOISE_TH_SIZE                                       (1u)
#define CY_CAPSENSE_BUTTON0_NNOISE_TH_PARAM_ID                                   (0x05000043u)

#define CY_CAPSENSE_BUTTON0_HYSTERESIS_VALUE                                     (cy_capsense_tuner.widgetContext[0].hysteresis)
#define CY_CAPSENSE_BUTTON0_HYSTERESIS_OFFSET                                    (68u)
#define CY_CAPSENSE_BUTTON0_HYSTERESIS_SIZE                                      (1u)
#define CY_CAPSENSE_BUTTON0_HYSTERESIS_PARAM_ID                                  (0x05000044u)

#define CY_CAPSENSE_BUTTON0_ON_DEBOUNCE_VALUE                                    (cy_capsense_tuner.widgetContext[0].onDebounce)
#define CY_CAPSENSE_BUTTON0_ON_DEBOUNCE_OFFSET                                   (69u)
#define CY_CAPSENSE_BUTTON0_ON_DEBOUNCE_SIZE                                     (1u)
#define CY_CAPSENSE_BUTTON0_ON_DEBOUNCE_PARAM_ID                                 (0x05000045u)

#define CY_CAPSENSE_BUTTON0_TX_CLK_SOURCE_VALUE                                  (cy_capsense_tuner.widgetContext[0].snsClkSource)
#define CY_CAPSENSE_BUTTON0_TX_CLK_SOURCE_OFFSET                                 (70u)
#define CY_CAPSENSE_BUTTON0_TX_CLK_SOURCE_SIZE                                   (1u)
#define CY_CAPSENSE_BUTTON0_TX_CLK_SOURCE_PARAM_ID                               (0x05000046u)

