RT-Thread/rt-thread/bsp/Infineon/psoc6-rtt-062S2/libs/TARGET_RTT-062S2/COMPONENT_BSP_DESIGN_MODUS/GeneratedSource/cycfg_capsense.h
#define CY_CAPSENSE_LINEARSLIDER0_STATUS_VALUE                                   (cy_capsense_tuner.widgetContext[2].status)
#define CY_CAPSENSE_LINEARSLIDER0_STATUS_OFFSET                                  (180u)
#define CY_CAPSENSE_LINEARSLIDER0_STATUS_SIZE                                    (1u)
#define CY_CAPSENSE_LINEARSLIDER0_STATUS_PARAM_ID                                (0x010200b4u)

#define CY_CAPSENSE_LINEARSLIDER0_PTRPOSITION_VALUE                              (cy_capsense_tuner.widgetContext[2].wdTouch.ptrPosition)
#define CY_CAPSENSE_LINEARSLIDER0_PTRPOSITION_OFFSET                             (184u)
#define CY_CAPSENSE_LINEARSLIDER0_PTRPOSITION_SIZE                               (4u)
#define CY_CAPSENSE_LINEARSLIDER0_PTRPOSITION_PARAM_ID                           (0x030200b8u)

#define CY_CAPSENSE_LINEARSLIDER0_NUM_POSITIONS_VALUE                            (cy_capsense_tuner.widgetContext[2].wdTouch.numPosition)
#define CY_CAPSENSE_LINEARSLIDER0_NUM_POSITIONS_OFFSET                           (188u)
#define CY_CAPSENSE_LINEARSLIDER0_NUM_POSITIONS_SIZE                             (1u)
#define CY_CAPSENSE_LINEARSLIDER0_NUM_POSITIONS_PARAM_ID                         (0x010200bcu)

#define CY_CAPSENSE_BUTTON0_RX0_RAW0_VALUE                                       (cy_capsense_tuner.sensorContext[0].raw)
#define CY_CAPSENSE_BUTTON0_RX0_RAW0_OFFSET                                      (192u)
#define CY_CAPSENSE_BUTTON0_RX0_RAW0_SIZE                                        (2u)
#define CY_CAPSENSE_BUTTON0_RX0_RAW0_PARAM_ID                                    (0x020000c0u)

#define CY_CAPSENSE_BUTTON0_RX0_BSLN0_VALUE                                      (cy_capsense_tuner.sensorContext[0].bsln)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN0_OFFSET                                     (194u)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN0_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN0_PARAM_ID                                   (0x020000c2u)

#define CY_CAPSENSE_BUTTON0_RX0_DIFF0_VALUE                                      (cy_capsense_tuner.sensorContext[0].diff)
#define CY_CAPSENSE_BUTTON0_RX0_DIFF0_OFFSET                                     (196u)
#define CY_CAPSENSE_BUTTON0_RX0_DIFF0_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON0_RX0_DIFF0_PARAM_ID                                   (0x020000c4u)

#define CY_CAPSENSE_BUTTON0_RX0_STATUS0_VALUE                                    (cy_capsense_tuner.sensorContext[0].status)
#define CY_CAPSENSE_BUTTON0_RX0_STATUS0_OFFSET                                   (198u)
#define CY_CAPSENSE_BUTTON0_RX0_STATUS0_SIZE                                     (1u)
#define CY_CAPSENSE_BUTTON0_RX0_STATUS0_PARAM_ID                                 (0x010000c6u)

#define CY_CAPSENSE_BUTTON0_RX0_NEG_BSLN_RST_CNT0_VALUE                          (cy_capsense_tuner.sensorContext[0].negBslnRstCnt)
#define CY_CAPSENSE_BUTTON0_RX0_NEG_BSLN_RST_CNT0_OFFSET                         (199u)
#define CY_CAPSENSE_BUTTON0_RX0_NEG_BSLN_RST_CNT0_SIZE                           (1u)
#define CY_CAPSENSE_BUTTON0_RX0_NEG_BSLN_RST_CNT0_PARAM_ID                       (0x010000c7u)

#define CY_CAPSENSE_BUTTON0_RX0_IDAC0_VALUE                                      (cy_capsense_tuner.sensorContext[0].idacComp)
#define CY_CAPSENSE_BUTTON0_RX0_IDAC0_OFFSET                                     (200u)
#define CY_CAPSENSE_BUTTON0_RX0_IDAC0_SIZE                                       (1u)
#define CY_CAPSENSE_BUTTON0_RX0_IDAC0_PARAM_ID                                   (0x010000c8u)

#define CY_CAPSENSE_BUTTON0_RX0_BSLN_EXT0_VALUE                                  (cy_capsense_tuner.sensorContext[0].bslnExt)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN_EXT0_OFFSET                                 (201u)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN_EXT0_SIZE                                   (1u)
#define CY_CAPSENSE_BUTTON0_RX0_BSLN_EXT0_PARAM_ID                               (0x010000c9u)

#define CY_CAPSENSE_BUTTON1_RX0_RAW0_VALUE                                       (cy_capsense_tuner.sensorContext[1].raw)
#define CY_CAPSENSE_BUTTON1_RX0_RAW0_OFFSET                                      (202u)
#define CY_CAPSENSE_BUTTON1_RX0_RAW0_SIZE                                        (2u)
#define CY_CAPSENSE_BUTTON1_RX0_RAW0_PARAM_ID                                    (0x020100cau)

#define CY_CAPSENSE_BUTTON1_RX0_BSLN0_VALUE                                      (cy_capsense_tuner.sensorContext[1].bsln)
#define CY_CAPSENSE_BUTTON1_RX0_BSLN0_OFFSET                                     (204u)
#define CY_CAPSENSE_BUTTON1_RX0_BSLN0_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON1_RX0_BSLN0_PARAM_ID                                   (0x020100ccu)

#define CY_CAPSENSE_BUTTON1_RX0_DIFF0_VALUE                                      (cy_capsense_tuner.sensorContext[1].diff)
#define CY_CAPSENSE_BUTTON1_RX0_DIFF0_OFFSET                                     (206u)
#define CY_CAPSENSE_BUTTON1_RX0_DIFF0_SIZE                                       (2u)
#define CY_CAPSENSE_BUTTON1_RX0_DIFF0_PARAM_ID                                   (0x020100ceu)

#define CY_CAPSENSE_BUTTON1_RX0_STATUS0_VALUE                                    (cy_capsense_tuner.sensorContext[1].status)
#define CY_CAPSENSE_BUTTON1_RX0_STATUS0_OFFSET                                   (208u)
#define CY_CAPSENSE_BUTTON1_RX0_STATUS0_SIZE                                     (1u)
#define CY_CAPSENSE_BUTTON1_RX0_STATUS0_PARAM_ID                                 (0x010100d0u)

#define CY_CAPSENSE_BUTTON1_RX0_NEG_BSLN_RST_CNT0_VALUE                          (cy_capsense_tuner.sensorContext[1].negBslnRstCnt)
#define CY_CAPSENSE_BUTTON1_RX0_NEG_BSLN_RST_CNT0_OFFSET                         (209u)
#define CY_CAPSENSE_BUTTON1_RX0_NEG_BSLN_RST_CNT0_SIZE                           (1u)
#define CY_CAPSENSE_BUTTON1_RX0_NEG_BSLN_RST_CNT0_PARAM_ID                       (0x010100d1u)

#define CY_CAPSENSE_BUTTON1_RX0_IDAC0_VALUE                                      (cy_capsense_tuner.sensorContext[1].idacComp)
#define CY_CAPSENSE_BUTTON1_RX0_IDAC0_OFFSET                                     (210u)
#define CY_CAPSENSE_BUTTON1_RX0_IDAC0_SIZE                                       (1u)
#define CY_CAPSENSE_BUTTON1_RX0_IDAC0_PARAM_ID                                   (0x010100d2u)

